pokedex/app/controllers/toys_controller.rb

  def update
    @toy = Toy.find(params[:id])
    if @toy.update(pokemon_id: params[:toy][:pokemon_id])
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["pokemon_id", 2], ["updated_at", "2015-08-04 00:56:05.367840"], ["id", 2]]