w7d4/skeleton/app/controllers/api/feeds_controller.rb

  def index
    @feeds = Feed.where("user_id = ?", current_user.id)
---
SELECT "feeds".* FROM "feeds" WHERE (user_id = 1)

  def show
    feed = Feed.find(params[:id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url], current_user.id)
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 06 Aug 2015 22:24:22 UTC +00:00], ["title", "News : NPR"], ["updated_at", Thu, 06 Aug 2015 22:24:22 UTC +00:00], ["url", "http://www.npr.org/rss/rss.php?id=1001"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://www.npr.org/rss/rss.php?id=1001' LIMIT 1